---
kind: type
id: T:Autodesk.Revit.Exceptions.RevitServerModelNameBreaksConventionException
source: html/ec0e702a-f076-1b44-4277-feefd39045d4.htm
---
# Autodesk.Revit.Exceptions.RevitServerModelNameBreaksConventionException

The exception that is thrown when the model is breaking the project naming convention.

## Syntax (C#)
```csharp
[SerializableAttribute]
public class RevitServerModelNameBreaksConventionException : RevitServerException
```